In [1]:
#windows
!pip install mysqlclient

Collecting mysqlclient
  Downloading mysqlclient-2.0.3-cp38-cp38-win_amd64.whl (179 kB)
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.0.3

In [2]:
# Mac users
#!conda install mysqlclient

In [52]:
import MySQLdb
import pandas as pd

In [51]:
db = MySQLdb.connect (user='user1',
                      passwd='password',
                      host='127.0.0.1',
                      db='my_db')
cur = db.cursor()
def get_allrecords():
    cur.execute("select * from Persons")
    for row in cur.fetchall() :
        print (row[0])
        print (row[1])
        print (row[2])
        print (row[3])
        
get_allrecords()
#db.close()

00002
Taylor
Swift
23
00003
Michael
Jackson
55
0001
Wei-Meng
Lee
25

In [47]:
def insert_record(ID, first_name, last_name, age) :    
    try:
        cur.execute("""INSERT INTO Persons (ID, FirstName, LastName, Age) VALUES (%s, %s, %s, %s)""", (ID, first_name, last_name, age))
        db.commit()
    except MySQLdb.Error as e:
        print ("Error %d: %s" % (e.args[0], e.args[1]))
        db.rollback()

insert_record('00003', 'Michael', 'Jackson', 55)

In [48]:
def update_record(ID, first_name, last_name, age) :
    try:
        cur.execute("""
            UPDATE Persons
            SET FirstName=%s,
            LastName=%s,
            Age=%s
            WHERE ID=%s
        """, (first_name, last_name, age, ID))
        db.commit()
    except MySQLdb.Error as e:
        print ("Error %d: %s" % (e.args[0], e.args[1]))
        db.rollback()

In [45]:
update_record('00002', 'Taylor', 'Swift', 23)

In [50]:
def delete_record(ID):
    try:
        cur.execute("""
            DELETE FROM Persons
            WHERE ID=%s
        """, [ID])
        db.commit()
    except MySQLdb.Error as e:
        print ("Error %d: %s" % (e.args[0], e.args[1]))
        db.rollback()

In [53]:
pd.read_sql('select * from persons', con=db)

      ID FirstName LastName  Age
0  00002    Taylor    Swift   23
1  00003   Michael  Jackson   55
2   0001  Wei-Meng      Lee   25

In [56]:
import pandas as pd 
import numpy as np
from sqlalchemy import create_engine

user = "user1"
password = "password"
engine = create_engine(f"mysql://{user}:{password}@{host}/{db}")
con = engine.connect()
df = pd.DataFrame(np.random.rand(5,3), columns=('A','B','C'))
df.to_sql(con = con, name='mytable', if_exists='replace')
df_database = pd.read_sql("SELECT * FROM mytable", con = con)
print(df_database)
#con.close()

   index         A         B         C
0      0  0.977429  0.172567  0.363494
1      1  0.949939  0.462965  0.069413
2      2  0.208220  0.215814  0.008830
3      3  0.037687  0.734373  0.474555
4      4  0.659887  0.427297  0.184114